#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

  # module.KEYCLOAK_TEST.module.moh_applications.module.BULK-USER-UPLOAD.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["realm-management/manage-users"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "217b2cb8-2417-474f-8ad2-70db7f55e5f5"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.BULK-USER-UPLOAD.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["realm-management/query-clients"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "57a520a8-a640-4502-b3f3-4b0bd4b7a1f9"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.BULK-USER-UPLOAD.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["realm-management/query-users"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "ddc3dbc6-4ab9-4b59-a7bd-e56785f3bc86"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.BULK-USER-UPLOAD.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["realm-management/view-clients"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "49c3e0d5-bec8-43a0-bab7-c8ddf91b2ce2"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.BULK-USER-UPLOAD.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["realm-management/view-users"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "5a35e168-27ad-4fc4-a574-e81ada1cc9be"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.BULK-USER-UPLOAD.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.BULK-USER-UPLOAD.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/manage-users"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "bafe798c-4703-452b-aad4-bc7ef8a48b70"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "manage-users"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.BULK-USER-UPLOAD.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/query-clients"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "bafe798c-4703-452b-aad4-bc7ef8a48b70"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "query-clients"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.BULK-USER-UPLOAD.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/query-users"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "bafe798c-4703-452b-aad4-bc7ef8a48b70"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "query-users"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.BULK-USER-UPLOAD.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/view-clients"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "bafe798c-4703-452b-aad4-bc7ef8a48b70"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-clients"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.BULK-USER-UPLOAD.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/view-users"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "bafe798c-4703-452b-aad4-bc7ef8a48b70"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-users"
      + service_account_user_id = (known after apply)
    }

Plan: 36 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*